simulation/openfoam/tjunction_3d_encoder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    oil_inlet
    {
        type            fixedValue;
        value           uniform (0.01983438 0 0);
    }

    dye1_inlet
    {
        type            fixedValue;
        value           uniform (0.00193021 0 0);   // c1 = 0.3333
    }

    dye2_inlet
    {
        type            fixedValue;
        value           uniform (0 -0.00193021 0);   // c2 = 0.3333
    }

    dye3_inlet
    {
        type            fixedValue;
        value           uniform (-0.00193021 0 0);   // c3 = 0.3333
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            noSlip;
    }

    symmetryPlane
    {
        type            symmetry;
    }

}

// ***************************** //
