simulation/openfoam/tjunction_3d_encoder/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oil_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    dye1_inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    dye2_inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    dye3_inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    walls
    {
        // ESI (v1912+) name: constantAlphaContactAngle
        // Foundation (11+) name: contactAngle
        // theta0 measured through the water phase; 160 deg = oil-wet.
        type            constantAlphaContactAngle;
        theta0          160;
        limit           gradient;
        value           uniform 0;
    }

    symmetryPlane
    {
        type            symmetry;
    }

}

// ***************************** //
