simulation/openfoam/tjunction_3d_encoder/0/dye3
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dye3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oil_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    dye1_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    dye2_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    dye3_inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    symmetryPlane
    {
        type            symmetry;
    }

}

// ***************************** //
