simulation/openfoam/tjunction_3d_encoder/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oil_inlet
    {
        type            zeroGradient;
    }

    dye1_inlet
    {
        type            zeroGradient;
    }

    dye2_inlet
    {
        type            zeroGradient;
    }

    dye3_inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    symmetryPlane
    {
        type            symmetry;
    }

}

// ***************************** //
