simulation/openfoam/tjunction_3d_encoder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale 1e-6;   // coordinates below are micrometres

vertices
(
    (0.0 0.0 0.0)   // 0
    (400.0 0.0 0.0)   // 1
    (400.0 800.0 0.0)   // 2
    (0.0 800.0 0.0)   // 3
    (0.0 0.0 400.0)   // 4
    (400.0 0.0 400.0)   // 5
    (400.0 800.0 400.0)   // 6
    (0.0 800.0 400.0)   // 7
    (2000.0 0.0 0.0)   // 8
    (2000.0 800.0 0.0)   // 9
    (2000.0 0.0 400.0)   // 10
    (2000.0 800.0 400.0)   // 11
    (2800.0 0.0 0.0)   // 12
    (2800.0 800.0 0.0)   // 13
    (2800.0 0.0 400.0)   // 14
    (2800.0 800.0 400.0)   // 15
    (4400.0 0.0 0.0)   // 16
    (4400.0 800.0 0.0)   // 17
    (4400.0 0.0 400.0)   // 18
    (4400.0 800.0 400.0)   // 19
    (6800.0 0.0 0.0)   // 20
    (6800.0 800.0 0.0)   // 21
    (6800.0 0.0 400.0)   // 22
    (6800.0 800.0 400.0)   // 23
    (2800.0 2000.0 0.0)   // 24
    (2000.0 2000.0 0.0)   // 25
    (2800.0 2000.0 400.0)   // 26
    (2000.0 2000.0 400.0)   // 27
    (400.0 2000.0 0.0)   // 28
    (2000.0 2800.0 0.0)   // 29
    (400.0 2800.0 0.0)   // 30
    (400.0 2000.0 400.0)   // 31
    (2000.0 2800.0 400.0)   // 32
    (400.0 2800.0 400.0)   // 33
    (2800.0 2800.0 0.0)   // 34
    (2800.0 2800.0 400.0)   // 35
    (4400.0 2000.0 0.0)   // 36
    (4400.0 2800.0 0.0)   // 37
    (4400.0 2000.0 400.0)   // 38
    (4400.0 2800.0 400.0)   // 39
    (2800.0 4400.0 0.0)   // 40
    (2000.0 4400.0 0.0)   // 41
    (2800.0 4400.0 400.0)   // 42
    (2000.0 4400.0 400.0)   // 43
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 20 10) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (40 20 10) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (20 20 10) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15) (40 20 10) simpleGrading (1 1 1)
    hex (16 20 21 17 18 22 23 19) (60 20 10) simpleGrading (1 1 1)
    hex (9 13 24 25 11 15 26 27) (20 30 10) simpleGrading (1 1 1)
    hex (28 25 29 30 31 27 32 33) (40 20 10) simpleGrading (1 1 1)
    hex (25 24 34 29 27 26 35 32) (20 20 10) simpleGrading (1 1 1)
    hex (24 36 37 34 26 38 39 35) (40 20 10) simpleGrading (1 1 1)
    hex (29 34 40 41 32 35 42 43) (20 40 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    oil_inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    dye1_inlet
    {
        type patch;
        faces
        (
            (28 31 33 30)
        );
    }
    dye2_inlet
    {
        type patch;
        faces
        (
            (41 43 42 40)
        );
    }
    dye3_inlet
    {
        type patch;
        faces
        (
            (36 37 39 38)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }
    symmetryPlane
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
            (10 14 15 11)
            (14 18 19 15)
            (18 22 23 19)
            (11 15 26 27)
            (31 27 32 33)
            (27 26 35 32)
            (26 38 39 35)
            (32 35 42 43)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (1 8 10 5)
            (2 6 11 9)
            (1 2 9 8)
            (8 12 14 10)
            (8 9 13 12)
            (12 16 18 14)
            (13 15 19 17)
            (12 13 17 16)
            (16 20 22 18)
            (17 19 23 21)
            (16 17 21 20)
            (9 11 27 25)
            (13 24 26 15)
            (9 25 24 13)
            (28 25 27 31)
            (30 33 32 29)
            (28 30 29 25)
            (25 29 34 24)
            (24 36 38 26)
            (34 35 39 37)
            (24 34 37 36)
            (29 32 43 41)
            (34 40 42 35)
            (29 41 40 34)
        );
    }
);

mergePatchPairs
(
);

// ***************************** //
