simulation/openfoam/tjunction_3d_encoder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Linear solver settings for interFoam
// Configured for microfluidic two-phase flow

solvers
{
    // Phase fractions. The regex must cover alpha.water1/2/3 AND alpha.oil --
    // multiphaseInterFoam solves every phase, so the narrower "alpha.water.*"
    // this was derived from would leave alpha.oil without a solver entry.
    "alpha.*"
    {
        // MULES (Multidimensional Universal Limiter with Explicit Solution)
        // Specialized for VOF interface tracking
        nAlphaCorr      2;          // Sub-cycles for alpha equation
        nAlphaSubCycles 1;          // Sub-iterations per time step
        
        // Compression settings
        MULESCorr       yes;
        nLimiterIter    5;
        cAlpha          1;      // interface compression (required by ESI interFoam)
        
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
    
    // The three dye scalars share this entry via `schemesField dye`.
    // Tolerance matches alpha's: the composition is a ratio of integrals of
    // these fields, so a loose solve here would show up directly as code
    // noise rather than as a small residual somewhere harmless.
    dye
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    // Corrector for alpha
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }
    
    // Pressure (p_rgh)
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
    }
    
    // Final pressure solve (tighter tolerance)
    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    
    // Velocity
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
}

// PIMPLE algorithm settings (Pressure-Implicit with splitting of operators)
PIMPLE
{
    // Number of PIMPLE outer loops
    nOuterCorrectors    1;
    
    // Number of pressure corrections
    nCorrectors         3;
    
    // Number of non-orthogonal corrections
    nNonOrthogonalCorrectors 1;
    
    // Use momentum predictor
    momentumPredictor   no;
}

// Relaxation factors (for steady-state runs, not typically needed for transient)
relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}

// ************************************************************************* //


