simulation/openfoam/tjunction_3d_encoder/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue dye1 0
    volScalarFieldValue dye2 0
    volScalarFieldValue dye3 0
);

regions
(
    boxToCell
    {
        box (0.0004 0.002 0) (0.002 0.0028 0.0004);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
    boxToCell
    {
        box (0.0004 0.002 0) (0.002 0.0028 0.0004);
        fieldValues ( volScalarFieldValue dye1 1 );
    }
    boxToCell
    {
        box (0.0028 0.002 0) (0.0044 0.0028 0.0004);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
    boxToCell
    {
        box (0.0028 0.002 0) (0.0044 0.0028 0.0004);
        fieldValues ( volScalarFieldValue dye3 1 );
    }
    boxToCell
    {
        box (0.002 0.0028 0) (0.0028 0.0044 0.0004);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
    boxToCell
    {
        box (0.002 0.0028 0) (0.0028 0.0044 0.0004);
        fieldValues ( volScalarFieldValue dye2 1 );
    }
    boxToCell
    {
        box (0.002 0.0008 0) (0.0028 0.0028 0.0004);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
    boxToCell
    {
        box (0.002 0.0008 0) (0.0028 0.0028 0.0004);
        fieldValues ( volScalarFieldValue dye1 0.333333 );
    }
    boxToCell
    {
        box (0.002 0.0008 0) (0.0028 0.0028 0.0004);
        fieldValues ( volScalarFieldValue dye2 0.333333 );
    }
    boxToCell
    {
        box (0.002 0.0008 0) (0.0028 0.0028 0.0004);
        fieldValues ( volScalarFieldValue dye3 0.333333 );
    }
);

// ***************************** //
